//11. Запросіть у користувача два числа через prompt і обчисліть їх відсоткову різницю та відношення.
let a=Number(prompt("введи перше число"))
let b=Number(prompt("введи друге число"))
alert("a-b="+((a-b)/a*100)+"%")
alert(a+":"+b+"="+1+":"+b/a)
//12. Запросіть у користувача три числа через prompt і виведіть їх максимальне та мінімальне значення.
let x1=Number(prompt("введіть перше число"))
let x2=Number(prompt("введіть друге число"))
let x3=Number(prompt("введіть третє число"))
if(x1>=x2 && x1>=x3){
    alert("Максимальне: " + x1)
}
else if(x2>=x1 && x2>=x3){
    alert("Максимальне: " + x2)
}
else{
    alert("Максимальне: " + x2)
}
if(x1<=x2 && x1<=x3){
    alert("Мінімальне: " + x1)
}
else if(x2<=x1 && x2<=x3){
    alert("Мінімальне: " + x2)
}
else{
    alert("Мінімальне: " + x2)
}
//13. Запросіть у користувача число через prompt і визначте, чи є воно простим.
a=Number(prompt("Введіть число: "))
if(a===1){
    alert("Число не просте")
}
else {
    let isSimple = true
    for (let i = 2; i < a; ++i) {
        if (a % i !== 0) {
            isSimple = false
            break
        }
    }
    if(isSimple){
        alert("Число просте")
    }
    else{
        alert("Число не просте")
    }
}
//14. Запросіть у користувача два числа через prompt і виведіть їх остачу від ділення.
a=Number(prompt("введи перше число"))
b=Number(prompt("введи друге число"))
alert("a%b="+a%b)
//15. Запросіть у користувача два числа через prompt і виведіть їх суму, піднесену до степеня третього.
a=Number(prompt("введи перше число"))
b=Number(prompt("введи друге число"))
alert("(a+b)^3="+(a+b)**3)